1atabey1/esp32tricore-dap/main/main.c
#include "sdkconfig.h"

#include <unistd.h>

#include "esp_log.h"
#include "esp_system.h"
#include "esp_mac.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "nvs_flash.h"
#include "esp_check.h"
#include "driver/uart.h"
#include "esp_timer.h"
#include "driver/ledc.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_http_client.h"
#include "esp_http_server.h"
#include "freertos/semphr.h"
#include "esp_wifi.h"
#include "driver/gpio.h"

#include "types.h"
#include "storage.h"
#include "network.h"
#include "descriptors.h"
#include "network_mngr.h"
#include "network_mngr_ota.h"
#include "web_server.h"
#include "uart_websocket.h"
#include "../components/lcd/lcd_library.h"
#include "GUI_Paint.h"
#include "gdb_main.h"
#include "boards/board_profile.h"
#include "port_cfg.h"
#include "dap_probe.h"
#include "tricore_bmp.h"
#if CONFIG_AEL_DAP_BRINGUP_AT_BOOT
#include "dap_phy.h"
#endif
#include "xvc_server.h"
#include "esp32jtag_common.h"
#include "ice.h"
#include "dap_main.h"
#include "usb_config.h"
#include "chry_ringbuffer.h"

#include <stdio.h>
#include <stdarg.h>

//in ../components/CherryDAP/dap_main.c
int usb_cdc_log_vprintf(const char *format, va_list args);
#define usb_log_vprintf usb_cdc_log_vprintf

extern void uartx_preinit(void);
extern void uart_event_task(void *pvParameters);

static void cherry_dap_task(void *arg) {
    if (g_app_params.uart_port_sel == 0) {
        uartx_preinit();
    }
    while (1) {
        chry_dap_handle();
        if (g_app_params.uart_port_sel == 0) {
            uart_event_task(NULL);
            chry_dap_usb2uart_handle();
        }
        // ESP_LOGI("DAP", "cherry_dap_task");
        vTaskDelay(1); // Optional yield if needed, but handle might be blocking or polling
    }
}

//assign {SWD_GPIO, LA_input_sel, cfgpd, cfgpb, cfgpa, njtag_swdio, sreset} = data_reg_0[6:0];  //from nvme1t/work/esp32jtag_v1d3_ice4kup/top.v

uint8_t global_data_reg_0 = 0; //for port configuration and sreset, njtag_swdio
uint8_t global_data_reg_1 = 0; //bit 7 to set wr_and_rd or read only, bit 6 to 0 to set PC and PD output enable and signal types

extern void platform_init(void); //from ./components/blackmagic_esp32
extern void logic_analyzer_init();

//global:
SemaphoreHandle_t capture_start_semaphore;
SemaphoreHandle_t capture_done_semaphore;
bool gbl_capture_started = false;
bool gbl_triggered_flag = true;
bool gbl_all_captured_flag = true;
uint32_t gbl_wr_addr_stop_position = 0;
uint32_t gbl_trigger_position = 0;

uint8_t *gbl_spi_rxbuf = NULL;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
#include "driver/uart_vfs.h"
#define vfs_dev_port_set_rx_line_endings uart_vfs_dev_port_set_rx_line_endings
#define vfs_dev_port_set_tx_line_endings uart_vfs_dev_port_set_tx_line_endings
#define vfs_dev_uart_use_driver uart_vfs_dev_use_driver
#else
#include "esp_vfs_dev.h"
#define vfs_dev_port_set_rx_line_endings esp_vfs_dev_uart_port_set_rx_line_endings
#define vfs_dev_port_set_tx_line_endings esp_vfs_dev_uart_port_set_tx_line_endings
#define vfs_dev_uart_use_driver esp_vfs_dev_uart_use_driver
#endif

static const char *TAG = "MAIN";
static const ael_board_profile_t *g_board = NULL;


//configurations for each ESP32JTAG 4 ports
uint8_t gbl_pa_cfg = 0;
uint8_t gbl_pb_cfg = 0;
uint8_t gbl_pc_cfg = 0;
uint8_t gbl_pd_cfg = 0;

app_params_t g_app_params;

adc_oneshot_unit_handle_t gbl_adc_handle = NULL;
adc_cali_handle_t adc1_cali_chan0_handle = NULL;

//components/blackmagic_esp32/src/platforms/esp32/main/gdb_if.c:void set_gdb_socket(int socket) 

extern void set_gdb_socket(int socket);
extern void set_gdb_listen(int socket);
unsigned short gbl_gdb_port = 4242; //same as stlink st-util GDB

extern volatile bool config_received;

spi_device_handle_t gbl_spi_h1 = NULL;

esp_err_t gpio_out_init(gpio_num_t gpio_num, uint32_t init_level)
{
    // 1. Configure the GPIO pin
    gpio_config_t io_conf = {};
    // Disable interrupt
    io_conf.intr_type = GPIO_INTR_DISABLE;
    // Set as output mode
    io_conf.mode = GPIO_MODE_OUTPUT;
    // Bit mask for the pins (only gpio_num)
    io_conf.pin_bit_mask = (1ULL << gpio_num);
    // Disable pull-down mode
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    // Disable pull-up mode
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;

    // Configure the GPIO with the settings
    gpio_config(&io_conf);
    
    // 2. Set the GPIO state to HIGH (3.3V)
    esp_err_t err = gpio_set_level(gpio_num, init_level);
    
    if (err == ESP_OK) {
        // Log success
        ESP_LOGI("GPIO_INIT", "GPIO %d initialized and set to %d successfully.", gpio_num, init_level);
    } else {
        // Log error if setting failed
        ESP_LOGE("GPIO_INIT", "Failed to init and set GPIO. Error code: %d", gpio_num, err);
    }
    return err;
    
}

static void init_gpio_sw1_sw2(void)
{
    const uint64_t pin_mask =
        ael_gpio_mask_if_valid(PIN_PUSHBUTTON_BOOT_SW1) |
        ael_gpio_mask_if_valid(PIN_PUSHBUTTON_SW2);

    if (pin_mask == 0) {
        ESP_LOGI(TAG, "No board buttons configured");
        return;
    }

    ESP_LOGI(TAG, "Init board buttons as input");
    gpio_config_t io_conf = {
        .mode = GPIO_MODE_INPUT,
        .pin_bit_mask = pin_mask,
        .pull_down_en = 0,
        .pull_up_en = 0,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&io_conf);
}

esp_err_t load_fpga(void)
{
    if (!g_board->has_fpga) {
        ESP_LOGW(TAG, "FPGA load requested on board '%s' without FPGA support", g_board->name);
        return ESP_ERR_NOT_SUPPORTED;
    }

    extern const unsigned char bitstream_bin_start[] asm("_binary_bitstream_bin_start");
    extern const unsigned char bitstream_bin_end[]   asm("_binary_bitstream_bin_end");
    extern const unsigned char dap_master_bin_start[] asm("_binary_dap_master_bin_start");
    extern const unsigned char dap_master_bin_end[]   asm("_binary_dap_master_bin_end");

    /*
     * The DAP master by default, not the stock image.
     *
     * The two are mutually exclusive: the DAP bitstream replaces the logic
     * analyser, XVC and the Port C passthrough the CPU-driven DAP path runs
     * over.  It is the default because it is what this board is for now - the
     * fabric master reaches 730 kB/s against the CPU path's 453 - and because
     * a probe that needs a bitstream uploaded before it works is a probe that
     * does not work after a power cycle.
     *
     * Set fpga_image to "stock" in NVS to get the other one back; that is the
     * way out that does not need a host holding the bitstream file.
     */
    bool  want_stock = false;
    char *choice     = NULL;
    if (storage_alloc_and_read(FPGA_IMAGE_KEY, &choice) == ESP_OK && choice) {
        want_stock = (strcmp(choice, "stock") == 0);
        free(choice);
    }

    const unsigned char *image = want_stock ? bitstream_bin_start
                                            : dap_master_bin_start;
    const size_t sz = want_stock ? (size_t)(bitstream_bin_end - bitstream_bin_start)
                                 : (size_t)(dap_master_bin_end - dap_master_bin_start);

    ESP_LOGI(TAG, "Configuring FPGA with the %s bitstream, %u bytes",
             want_stock ? "stock" : "DAP master", (unsigned)sz);

