1atabey1/esp32tricore-dap/main/main.c
    uint8_t cfg_stat;
    int8_t retry = 3;
    while ((cfg_stat = ICE_FPGA_Config(image, sz)) && (--retry)) {
        ESP_LOGW(TAG, "FPGA configured ERROR - status = %d retry=%d", cfg_stat, retry);
    }
    if (retry)
        ESP_LOGI(TAG, "FPGA configured OK - status = %d retry=%d", cfg_stat, retry);
    else
        ESP_LOGW(TAG, "FPGA configured ERROR - giving up");

    return ESP_OK;
}

#define SPI_MAX_TRANSFER_BYTES  4096
#define SPI_CLK_MHZ             (20*1000*1000)
#define INITIAL_VIO_DUTY        8   /* 8/1024 → ~3.30V output */

#if AEL_BOARD_HAS_TARGET_VIO_PWM
/* PWM duty values for Target IO Voltage UI options (index matches HTML option value):
 *   0 = 3.3V -> duty   8
 *   1 = 2.5V -> duty 123
 *   2 = 1.8V -> duty 228
 *   3 = 1.5V -> duty 271
 *   4 = 1.2V -> duty 318
 * Derived from empirical measurements on ESP32JTAG v1.3/v1.4 hardware.
 * Default (fresh flash / factory reset) is index 0 = 3.3V. */
static const uint16_t vio_duty_table[] = { 8, 123, 228, 271, 318 };
#define VIO_DUTY_TABLE_SIZE  (sizeof(vio_duty_table) / sizeof(vio_duty_table[0]))
#endif

static spi_device_handle_t spi_device_1_manual_handle;
static spi_device_handle_t spi_device_2_hw_handle;
static spi_device_handle_t spi_device_3_hw_handle;
static spi_device_handle_t spi_device_4_hw_handle;
/*
 * Release SPI2 so the DAP probe can clock with hardware instead of GPIO.
 *
 * SPI2 carries the XVC devices, and SPI3 carries the FPGA bitstream loader,
 * every logic-analyser capture and the LCD - so SPI2 is the only one of the
 * two that can be given away without breaking the pin path the probe itself
 * depends on.  XVC is JTAG over the network, which is exactly the thing DAP
 * replaces, so nothing that matters is lost; a reboot brings it back.
 *
 * Called from the DAP backend when it finds SPI2 already initialised.  The XVC
 * task is only started when the port configuration selects FPGA+XVC, and DAP
 * needs Port C in SWD/JTAG mode instead, so in the configuration this runs in
 * there is no task holding these handles.
 */
esp_err_t spi_release_xvc_bus(void)
{
    spi_device_handle_t *devs[3] = {
        &spi_device_2_hw_handle, &spi_device_3_hw_handle, &spi_device_4_hw_handle
    };

    if (g_board->has_xvc && gbl_pd_cfg == PD_FPGA_XVC) {
        ESP_LOGE(TAG, "refusing to free SPI2: the XVC server is using it");
        return ESP_ERR_INVALID_STATE;
    }

    for (int i = 0; i < 3; i++) {
        if (*devs[i]) {
            spi_bus_remove_device(*devs[i]);
            *devs[i] = NULL;
        }
    }
    const esp_err_t err = spi_bus_free(XVC_SPI_HOST);
    ESP_LOGW(TAG, "released SPI2 from XVC for the DAP probe: %s", esp_err_to_name(err));
    return err;
}

esp_err_t spi_master_init(void){
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "SPI/FPGA fabric init skipped for board '%s'", g_board->name);
        return ESP_OK;
    }
    ESP_LOGI(TAG, "Doing spi_master_init()");


    // 1. Bus configuration (same for all devices on this bus)
    spi_bus_config_t buscfg = {
        .mosi_io_num = PIN_NUM_MOSI,
        .miso_io_num = PIN_NUM_MISO,
        .sclk_io_num = PIN_NUM_CLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = SPI_MAX_TRANSFER_BYTES
    };

    // Initialize the bus
    //esp_err_t ret = spi_bus_initialize(SPI_HOST_USED, &buscfg, SPI_DMA_CH_AUTO);
    esp_err_t ret = spi_bus_initialize(XVC_SPI_HOST, &buscfg, SPI_DMA_CH_AUTO);
    //esp_err_t ret = spi_bus_initialize(XVC_SPI_HOST, &buscfg, SPI_DMA_DISABLED);
    if (ret != ESP_OK){
        return ret;
    }

    // 2. Device 1 configuration with manual CS control
    spi_device_interface_config_t devcfg_1_manual = {
        //.clock_speed_hz = SPI_CLK_MHZ,
#if USING_ARTIX7_BOARD
        .clock_speed_hz = 26*1000*1000, //
#else
        .clock_speed_hz = 40*1000*1000, //
#endif
        .mode = 0,
        .spics_io_num = -1, // Use -1 for manual control
        //.spics_io_num = PIN_NUM_CS0, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 1 to the bus, getting its unique handle
    //ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_1_manual, &spi_device_1_manual_handle);
    ret = spi_bus_add_device(SPI_HOST_USED, &devcfg_1_manual, &spi_device_1_manual_handle);//using SPI_HOST_USED!!! Same as LCD
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_1_manual failed");
        return ret;
    }
    gbl_spi_h1 = spi_device_1_manual_handle; //spi device for LA capture

    // 3. Device 2 configuration with hardware CS control
    spi_device_interface_config_t devcfg_2_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS1, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 2 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_2_hw, &spi_device_2_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_2_hw failed");
        return ret;
    }

    // 4. Device 3 configuration with hardware CS control
    spi_device_interface_config_t devcfg_3_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS2, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 3 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_3_hw, &spi_device_3_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_3_hw failed");
        return ret;
    }
    ESP_LOGI(TAG, "spi_bus_add_device devcfg_3_hw OK!");

    // 5. Device 4 configuration with hardware CS control
    spi_device_interface_config_t devcfg_4_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS3, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 4 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_4_hw, &spi_device_4_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_4_hw failed");
        return ret;
    }
    ESP_LOGI(TAG, "spi_bus_add_device devcfg_4_hw OK!");

