1atabey1/esp32tricore-dap/main/main.c
    char *ap_pass = NULL;
    if (storage_alloc_and_read(WIFI_AP_PASS_KEY, &ap_pass) == ESP_OK && ap_pass) {
        strncpy(g_app_params.wifi_pass, ap_pass, sizeof(g_app_params.wifi_pass) - 1);
        g_app_params.wifi_pass[sizeof(g_app_params.wifi_pass) - 1] = '\0';
        free(ap_pass);
    } else {
        strcpy(g_app_params.wifi_pass, WIFI_AP_PASSW);
        storage_write(WIFI_AP_PASS_KEY, WIFI_AP_PASSW, strlen(WIFI_AP_PASSW));
        ESP_LOGI(TAG, "Saved default AP Password to NVS");
    }
}

/*
 * Load WiFi network parameters from NVS.
 * If WIFI_MODE_KEY is missing (first boot), defaults to AP mode.
 * If menuconfig has user values and NVS has no SSID, uses STA mode.
 */
static void load_network_params(void) {
    // SINGLE SOURCE OF TRUTH: Read WIFI_MODE_KEY ("SM" or "AP")
    char *wifi_mode_str = NULL;
    bool is_sta_mode = false;

    if (storage_alloc_and_read(WIFI_MODE_KEY, &wifi_mode_str) == ESP_OK && wifi_mode_str) {
        if (strcmp(wifi_mode_str, "SM") == 0) {
            is_sta_mode = true;
        }
        ESP_LOGI(TAG, "Read WIFI_MODE_KEY: %s, setting mode to %s", wifi_mode_str, is_sta_mode ? "STA" : "AP");
        free(wifi_mode_str);
    } else {
        // Default to AP if key is missing (first boot)
        ESP_LOGW(TAG, "WIFI_MODE_KEY not found. Defaulting to AP Mode and saving to NVS.");
        is_sta_mode = false;
        storage_write(WIFI_MODE_KEY, "AP", 2);
    }

    size_t ssid_len = storage_get_value_length(WIFI_SSID_KEY);
    ESP_LOGI(TAG, "ssid_len:%d", ssid_len);

    if (!is_sta_mode) {
        ESP_LOGW(TAG, "Activating AP mode!");
        g_app_params.mode = APP_MODE_AP;
        load_ap_params();
    }
    else {
        if (ssid_len == 0) {
            ESP_LOGW(TAG, "Failed to get WiFi SSID len from nvs.");
            if (!strcmp(CONFIG_ESP_WIFI_SSID, WIFI_AP_SSSID)) {
                ESP_LOGW(TAG, "Default values read from menuconfig. AP mode will be activated!");
                g_app_params.mode = APP_MODE_AP;
                strcpy(g_app_params.wifi_ssid, WIFI_AP_SSSID);
                strcpy(g_app_params.wifi_pass, WIFI_AP_PASSW);
            } else {
                ESP_LOGW(TAG, "User values read from menuconfig. STA mode will be activated!");
                g_app_params.mode = APP_MODE_STA;
                strcpy(g_app_params.wifi_ssid, CONFIG_ESP_WIFI_SSID);
                strcpy(g_app_params.wifi_pass, CONFIG_ESP_WIFI_PASSWORD);
            }
        } else {
            g_app_params.mode = APP_MODE_STA;
            esp_err_t err = storage_read(WIFI_SSID_KEY, g_app_params.wifi_ssid, ssid_len);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to read WiFi ssid");
            } else {
                size_t pass_len = storage_get_value_length(WIFI_PASS_KEY);
                if (pass_len == 0) {
                    ESP_LOGW(TAG, "Failed to get WiFi password len");
                } else {
                    err = storage_read(WIFI_PASS_KEY, g_app_params.wifi_pass, pass_len);
                    if (err != ESP_OK) {
                        ESP_LOGW(TAG, "Failed to read WiFi password");
                    }
                }
            }
        }
    }

    if (g_app_params.mode == APP_MODE_AP) {
        g_app_params.net_adapter_name = "wifiap";
    } else if (g_app_params.mode == APP_MODE_STA) {
        g_app_params.net_adapter_name = "wifista";
    }

    ESP_LOGI(TAG, "app mode (%s)", g_app_params.mode == APP_MODE_AP ? "Access Point" : "Station");
    ESP_LOGI(TAG, "wifi ssid (%s)", g_app_params.wifi_ssid);
    ESP_LOGI(TAG, "wifi pass (%s)", g_app_params.wifi_pass);
}

static void init_idf_components(void) {
    ESP_LOGI(TAG, "Setting up...\n");
    //init_console();
    ESP_ERROR_CHECK(storage_init_filesystem());
    ESP_ERROR_CHECK(nvs_flash_init());
    storage_init_nvs();
    esp_netif_init();
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    char *disable_dap_val = NULL;
    bool disable_usb_dap = true;  /* default: disabled */
    if (storage_alloc_and_read(DISABLE_USB_DAP_KEY, &disable_dap_val) == ESP_OK && disable_dap_val) {
        disable_usb_dap = (strcmp(disable_dap_val, "1") == 0);
        free(disable_dap_val);
    }

    if (!disable_usb_dap) {
        chry_dap_init(0, ESP_USBD_BASE);
    } else {
        ESP_LOGI(TAG, "Skipping chry_dap_init because USB DAP is disabled.");
    }
    // Redirect logs to USB CDC
    //esp_log_set_vprintf(usb_log_vprintf);
}

static bool get_ap_ip_str(char *buf, size_t buf_len) {
    if (buf == NULL || buf_len < 16) {
        return false;
    }

    esp_netif_ip_info_t ip_info;
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");

    if (netif == NULL) {
        return false;
    }
    if (esp_netif_get_ip_info(netif, &ip_info) != ESP_OK) {
        return false;
    }

    snprintf(buf, buf_len, IPSTR, IP2STR(&ip_info.ip));
    return true;
}

/*--- ADC Calibration ---*/
static bool adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle)
{
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
        adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
        adc_cali_line_fitting_config_t cali_config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif
    *out_handle = handle;
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Calibration Success");
    } else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated) {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    } else {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

