1atabey1/esp32tricore-dap/main/main.c
    return calibrated;
}

/* Voltage scaling constants: vtarget_mV = adc_mV * NUM / DEN */
#define ADC_VTARGET_SCALE_NUM  (34 * 958)
#define ADC_VTARGET_SCALE_DEN  9470

static void AD_CH1_init(void)
{
    int voltage;
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT_1,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config, &gbl_adc_handle));

    adc_oneshot_chan_cfg_t channel_config = {
        //.bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = ADC_ATTEN_DB_12,  // Allows input voltage up to ~3.3V
        .bitwidth = ADC_BITWIDTH_DEFAULT, //ADC_BITWIDTH_12,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(gbl_adc_handle, ADC_CHANNEL_0, &channel_config));

    bool do_calibration1_chan0 = adc_calibration_init(ADC_UNIT_1, ADC_CHANNEL_0,ADC_ATTEN_DB_12, &adc1_cali_chan0_handle);

    int adc_raw;
    esp_err_t result = adc_oneshot_read(gbl_adc_handle, ADC_CHANNEL_0, &adc_raw);

    if (result == ESP_OK) {
        ESP_LOGI(TAG, "ADC Raw: %d", adc_raw);
        if (do_calibration1_chan0) {
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc1_cali_chan0_handle,adc_raw, &voltage));
            int vtarget = voltage * ADC_VTARGET_SCALE_NUM / ADC_VTARGET_SCALE_DEN;
            ESP_LOGI(TAG, "ADC%d Channel[%d] Cali Voltage: %d mV vtarget=%d mV", ADC_UNIT_1 + 1, ADC_CHANNEL_0, voltage, vtarget);
        }
    } else {
        ESP_LOGE(TAG, "ADC Read Failed");
    }
}

static void setup_pwm1(void)
{
    if (!g_board || !g_board->has_target_vio_pwm) {
        return;
    }

    ledc_timer_config_t ledc_timer1 = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .timer_num = LEDC_TIMER_1,
        //.duty_resolution  = LEDC_TIMER_13_BIT,      // Resolution of PWM duty (2^13 = 8192 levels)
        .duty_resolution = LEDC_TIMER_10_BIT,      // Resolution of PWM duty (2^10 = 1024 levels)
        .freq_hz = 5000,                   // Frequency in Hertz
        .clk_cfg = LEDC_AUTO_CLK
    };
    ledc_timer_config(&ledc_timer1);

    ledc_channel_config_t ledc_channel1 = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = LEDC_CHANNEL_1,
        .timer_sel = LEDC_TIMER_1,
        .intr_type = LEDC_INTR_DISABLE,
        .gpio_num = 16,                       // GPIO where PWM is output
        .duty = 0,                        // Initial duty cycle (0%)
        .hpoint = 0
    };
    ledc_channel_config(&ledc_channel1);
}

static void set_pwm1_duty(uint16_t duty)
{
    if (!g_board || !g_board->has_target_vio_pwm) {
        return;
    }

    // Set brightness
    ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1, duty);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1);
}


// Helper to get font width if not defined as macro
// Assuming standard usage as per GUI_Paint.h
#ifndef PAINT_CHAR_WIDTH
#define PAINT_CHAR_WIDTH 12
#endif

static void print_sta_info(void)
{
    wifi_sta_list_t sta_list;
    esp_err_t ret = esp_wifi_ap_get_sta_list(&sta_list);

    static int prev_num_stations = -1;  /* Retain last LCD state across calls */
    static int prev_rssi = 1;           /* Retain last LCD state across calls */

    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Number of connected stations: %d", sta_list.num);

        int current_rssi = 0;
        if(sta_list.num > 0){
             current_rssi = sta_list.sta[0].rssi;
        }

        // Update LCD if changed
        if (sta_list.num != prev_num_stations || (sta_list.num > 0 && current_rssi != prev_rssi)) {
            // Use the line below "AP Mode" to avoid width issues
            int x_pos = X_OFFSET + 7 * PAINT_CHAR_WIDTH;//7: "AP Mode"
            int y_pos = 10;

            if (sta_list.num > 0) {
                // "-29dBm" (Yellow)
                char rssi_buf[16];
                snprintf(rssi_buf, sizeof(rssi_buf), " %ddBm", current_rssi);
                Paint_DrawString_EN(x_pos, y_pos, rssi_buf, &CURR_FONT, BLACK, YELLOW);
                x_pos += strlen(rssi_buf) * PAINT_CHAR_WIDTH;

                // "1 Connection" (Green)
                char conn_buf[32];
                snprintf(conn_buf, sizeof(conn_buf), " %d Conn", sta_list.num);
                Paint_DrawString_EN(x_pos, y_pos, conn_buf, &CURR_FONT, BLACK, GREEN);
                x_pos += strlen(conn_buf) * PAINT_CHAR_WIDTH;
            } else {
                 // Clear the line if no connections
                 Paint_DrawString_EN(x_pos, y_pos, "               ", &CURR_FONT, BLACK, BLACK);
            }

            // Clear trailing artifacts
            //Paint_DrawString_EN(x_pos, y_pos, "  ", &CURR_FONT, BLACK, BLACK);

            prev_num_stations = sta_list.num;
            prev_rssi = current_rssi;
        }

        for (int i = 0; i < sta_list.num; i++) {
            wifi_sta_info_t sta = sta_list.sta[i];
            ESP_LOGI(TAG, "STA %d: MAC=%02X:%02X:%02X:%02X:%02X:%02X, RSSI=%d dBm",
                     i + 1,
                     sta.mac[0], sta.mac[1], sta.mac[2],
                     sta.mac[3], sta.mac[4], sta.mac[5],
                     sta.rssi);
        }
    } else {
        ESP_LOGE(TAG, "Failed to get STA list: %s", esp_err_to_name(ret));
    }
}
esp_err_t set_cfga(bool use_porta, bool use_portb, bool use_portc, bool use_portd, bool njtag_swdio, bool swd_gpio){
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_cfga skipped on board '%s'", g_board->name);
        return ESP_OK;
    }
    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;

    global_data_reg_0 &= ~(CFGPA | CFGPB | CFGPC | CFGPD);

    if(use_porta) {
        global_data_reg_0 |= CFGPA;
    }
    if(use_portb) {
        global_data_reg_0 |= CFGPB;
    }
    if(use_portc) {
        global_data_reg_0 |= CFGPC;
    }
    if(use_portd) {
        global_data_reg_0 |= CFGPD;
    }

    if(njtag_swdio){
        global_data_reg_0 |= NJTAG_SWDIO;
    }
    else{
        global_data_reg_0 &= ~NJTAG_SWDIO;
    }
    if(swd_gpio){
        global_data_reg_0 |= SWD_GPIO;
    }
    else{
        global_data_reg_0 &= ~SWD_GPIO;
    }

    tx[1] = global_data_reg_0;
    ESP_LOGI(TAG, "set_cfga: global_data_reg_0=0x%02x use_porta/b/c/d=%d %d %d %d, jtag_swdio=%d, swd_gpio=%d", 
            global_data_reg_0, use_porta, use_portb, use_portc, use_portd, njtag_swdio, swd_gpio);

    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "rx=0x%02x %02x %02x",rx[0],rx[1], rx[2]);
    return ret1;
}
esp_err_t set_la_input_sel(bool use_test_signal)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_la_input_sel skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;
    if(use_test_signal) {
        global_data_reg_0 |= LA_INPUT_SEL;//use internal cnt1 as LA input
    }
    else{
        global_data_reg_0 &= ~LA_INPUT_SEL;
    }
    tx[1] = global_data_reg_0;

    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "rx=0x%02x %02x %02x",rx[0],rx[1], rx[2]);
    return ret1;
}
/* Assert (true) or deassert (false) the SRESET signal on Port B pin3.
 * Port B must be configured as PB_UART_SRESET_VTARGET for the signal
 * to physically appear on the connector. */
esp_err_t set_sreset(bool assert_reset)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_sreset skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;
    /* Convert the logical reset state to the configured electrical level. */
    const bool output_high = gbl_sreset_polarity ? !assert_reset : assert_reset;
    if (output_high) {
        global_data_reg_0 |= SRESET;
    } else {
        global_data_reg_0 &= ~SRESET;
    }
    tx[1] = global_data_reg_0;
    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "set_sreset(asserted=%d, level=%s): global_data_reg_0=0x%02x",
             assert_reset, output_high ? "HIGH" : "LOW", global_data_reg_0);
    return ret1;
}

bool sreset_is_asserted(void)
{
    const bool output_high = (global_data_reg_0 & SRESET) != 0;
    return gbl_sreset_polarity ? !output_high : output_high;
}

/* Control Port D (P3) signal output via data_reg_1 outsig_sel field.
 * Requires cfgpd=0 (Port D in Logic Analyzer / non-XVC mode).
 *
 * mode:
 *   0 = PORTD_OUT_TRISTATE   — Port D pins tristate (LA input, default)
 *   1 = PORTD_OUT_COUNTER_LO — drive cnt1[3:0]  (132 MHz free-running counter low nibble)
 *   2 = PORTD_OUT_COUNTER_HI — drive cnt1[7:4]  (counter high nibble)
 *   3 = PORTD_OUT_GPIO       — drive data_reg_1[3:0] directly (value = 0..15)
 */
#if CONFIG_AEL_DAP_BRINGUP_AT_BOOT
/*
 * Watch the DAP wires with the board's own logic analyser.
 *
 * Port C is logic-analyser channels 8..11, which is exactly where the DAP
 * signals sit: PC01=ch8 (DAP2), PC02=ch9 (DAP0 clock), PC03=ch10 (DAP1 data),
 * PC04=ch11 (TRST).  The capture block samples the pads, so this works while
 * Port C is muxed to Black Magic Probe rather than to the analyser - which is
 * the whole point, since that is the configuration the probe runs in.
 *
 * The question this answers first: does our clock actually reach the connector?
 * The self-drive check only ever proved the bidirectional pin, and DAP0 and
 * TRST share a register-controlled output enable rather than GPIO 45's.  So the
 * trigger is armed on the clock channel: if the capture never triggers, the
 * clock is not getting out, and no amount of protocol theory matters.
 */
extern uint8_t *psram_buffer;   /* the 128 KB capture landing buffer, in ice.c */

#define DAP_LA_CH_DAP2   8
#define DAP_LA_CH_DAP0   9
#define DAP_LA_CH_DAP1  10
#define DAP_LA_CH_TRST  11

static void dap_la_summarise(const uint16_t *samples, size_t count)
{
    static const char *names[4] = { "DAP2/PC01", "DAP0/PC02", "DAP1/PC03", "TRST/PC04" };

    for (int c = 0; c < 4; c++) {
        const int ch = DAP_LA_CH_DAP2 + c;
        int  edges = 0;
        int  high  = 0;
        int  first_edge = -1;
        int  prev = (samples[0] >> ch) & 1;

