1atabey1/esp32tricore-dap/main/main.c
        for (size_t i = 0; i < count; i++) {
            const int bit = (samples[i] >> ch) & 1;
            high += bit;
            if (bit != prev) {
                edges++;
                if (first_edge < 0) {
                    first_edge = (int)i;
                }
                prev = bit;
            }
        }
        ESP_LOGI(TAG, "  ch%-2d %-10s edges=%-6d high=%d%%  first edge at sample %d",
                 ch, names[c], edges, (int)((100L * high) / (long)count), first_edge);
    }
}

/* Arm the analyser on the clock channel and hand back once it is waiting. */
static void dap_la_arm(void)
{
    gbl_sample_rate_reg  = 2;         /* 132/3 = 44 MHz, 64 Ki samples ~ 1.49 ms */
    gbl_trigger_enabled  = true;
    gbl_trigger_mode_or  = true;
    gbl_trigger_position = 5;
    for (int i = 0; i < 16; i++) {
        gbl_channel_triggers[i] = TRIGGER_DISABLED;
    }
    gbl_channel_triggers[DAP_LA_CH_DAP0] = TRIGGER_RISING;
    start_capture(false);
}

/* Wait for the capture to complete, read it back and summarise it. */
static bool dap_la_collect(const char *what)
{
    for (int attempt = 0; attempt < 20 && !gbl_triggered_flag; attempt++) {
        read_capture_status();
        if (!gbl_triggered_flag) {
            vTaskDelay(pdMS_TO_TICKS(10));
        }
    }
    if (!gbl_triggered_flag) {
        ESP_LOGE(TAG, "  %s: no trigger - the clock never reached PC02", what);
        return false;
    }

    read_and_return_capture();
    const uint16_t *samples = (const uint16_t *)(psram_buffer + 4);
    const size_t    count   = (ICE_CAPTURE_BUFFER_SIZE - 4) / sizeof(uint16_t);

    ESP_LOGI(TAG, "  %s:", what);
    dap_la_summarise(samples, count);
    return true;
}

/*
 * Which level of the direction pin lets our data out?
 *
 * Drives an alternating pattern on DAP1 with the direction pin held at each
 * level in turn, and watches the connector.  Exactly one of the two should show
 * the pattern on ch10; whichever it is settles the polarity, and if neither
 * does then the FPGA is not passing our data at all in this port mode.
 */
static void dap_la_direction_polarity(void)
{
    for (int dir = 0; dir <= 1; dir++) {
        dap_la_arm();
        dap_phy_force_dir(dir);
        dap_phy_training_pattern(32);   /* 128 clocks, DAP1 alternating */
        char label[48];
        snprintf(label, sizeof(label), "dir=%d, 128 clocks of alternating DAP1", dir);
        dap_la_collect(label);
    }
}

/*
 * Is anything actually attached to the data line?
 *
 * Hold DAP1 low with the probe driving, then release it and watch how fast the
 * pad comes back up.  The rise is an RC against whatever pull-up is on the net:
 *
 *   only the ICE40's own input pull-up (~100 k) into pad plus a little cable
 *   capacitance takes microseconds - hundreds of samples at 44 MHz;
 *   a target pin with its own pull-up of a few tens of k is several times
 *   faster; a target holding the line down means it never rises at all.
 *
 * This distinguishes a bare floating pad from a connected target pin, which is
 * the one thing the edge counts cannot tell apart.
 */
static void dap_la_release_time(void)
{
    ESP_LOGI(TAG, "  release test: hold DAP1 low, let go, time the rise");

    for (int start_level = 0; start_level <= 1; start_level++) {
        dap_phy_force_dir(0);
        dap_phy_drive_data(start_level);
        vTaskDelay(pdMS_TO_TICKS(5));

        gbl_sample_rate_reg  = 2;
        gbl_trigger_enabled  = true;
        gbl_trigger_mode_or  = true;
        gbl_trigger_position = 5;
        for (int i = 0; i < 16; i++) {
            gbl_channel_triggers[i] = TRIGGER_DISABLED;
        }
        gbl_channel_triggers[DAP_LA_CH_DAP0] = TRIGGER_RISING;
        start_capture(false);

        dap_phy_idle_clocks(1, start_level);   /* marker, data still held */
        dap_phy_turnaround_to_read();          /* release */

        char label[72];
        snprintf(label, sizeof(label),
                 "released from %s: does the net move on its own?",
                 start_level ? "high" : "low");
        dap_la_collect(label);
    }
}

/*
 * Which of the four Port C wires is attached to a target pull-up?
 *
 * A powered target's DAP1 sits behind a pull-up on any sane debug header,
 * while its DAP0 is a probe-clocked input with nothing pulling it.  So:
 * drive every pin we can reach low, then tri-state the whole port by taking
 * Port C out of SWD/JTAG mode, and watch which channels come back up.  The
 * ones that rise are connected to something that pulls; the ones that hold
 * low are inert.
 *
 * This identifies the real DAP1 without anyone tracing a wire, and it works
 * regardless of how the cables happen to be arranged.
 */
static void dap_la_find_pulled_pins(bool restore_portc, bool use_portb, bool use_portd)
{
    ESP_LOGI(TAG, "  pull-up hunt: drive Port C low, tri-state it, see what rises");

    /*
     * Only the data line is driven low here.  An earlier version pulled all
     * four Port C pins down, which is how this board stopped the target's
     * application: one of these wires reaches a pin the target samples at
     * reset, so a low pulse per boot of ours was rebooting it into another
     * mode.  Never drive a wire whose target-side function is unknown.
     */
    dap_phy_force_dir(0);
    dap_phy_drive_data(0);                 /* PC03 (data) only */
    vTaskDelay(pdMS_TO_TICKS(5));

    gbl_sample_rate_reg  = 2;
    gbl_trigger_enabled  = true;
    gbl_trigger_mode_or  = true;           /* any of the four may fire */
    gbl_trigger_position = 5;
    for (int i = 0; i < 16; i++) {
        gbl_channel_triggers[i] = TRIGGER_DISABLED;
    }
    for (int ch = DAP_LA_CH_DAP2; ch <= DAP_LA_CH_TRST; ch++) {
        gbl_channel_triggers[ch] = TRIGGER_RISING;
    }
    start_capture(false);

    /* cfgpc = 0 takes Port C to high impedance: nothing on our side drives it. */
    set_cfga(false, use_portb, false, use_portd, true, true);

    if (!dap_la_collect("tri-stated - a channel at high% is pulled by the target")) {
        ESP_LOGW(TAG, "    nothing rose: no target pull-up on any Port C wire");
    }

