1atabey1/esp32tricore-dap/main/main.c
    if (restore_portc) {
        set_cfga(false, use_portb, true, use_portd, true, true);
    }
}

static bool b_use_portb_cached, b_use_portd_cached;

static void dap_la_capture_test(void)
{
    if (!g_board->has_logic_analyzer) {
        return;
    }

    ESP_LOGI(TAG, "=== DAP wire capture: arming on the clock channel ===");

    /*
     * This runs before start_background_tasks(), so logic_analyzer_init() has
     * not allocated the landing buffer yet.  Allocating it here is safe and
     * idempotent: the allocation in ice.c is guarded on psram_buffer == NULL.
     */
    if (psram_buffer == NULL) {
        psram_buffer = heap_caps_malloc(ICE_CAPTURE_BUFFER_SIZE, MALLOC_CAP_SPIRAM);
        if (psram_buffer == NULL) {
            ESP_LOGE(TAG, "  no PSRAM for the capture buffer");
            return;
        }
    }

    if (dap_probe_init(CONFIG_AEL_DAP_BRINGUP_CLOCK_HZ) != ESP_OK) {
        ESP_LOGE(TAG, "  PHY init failed, nothing to capture");
        return;
    }
    dap_la_arm();                     /* armed, waiting for the clock's first edge */
    dap_exchange_t x;
    dap_probe_sync(&x);               /* the traffic we want to see on the wire */
    dap_la_collect("sync frame plus reply window");

    /* Then settle what the sync capture only hints at. */
    dap_la_direction_polarity();
    dap_la_release_time();
    /* restore_portc = false: leave the port high impedance afterwards so the
     * board holds nothing against the target between sessions. */
    dap_la_find_pulled_pins(false, b_use_portb_cached, b_use_portd_cached);
    ESP_LOGW(TAG, "Port C left high impedance; re-enable it before debugging");
}
#endif /* CONFIG_AEL_DAP_BRINGUP_AT_BOOT */

esp_err_t set_portd_output(uint8_t mode, uint8_t value)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_portd_output skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    esp_err_t ret;
    uint8_t tx[3] = {0, 0, 0};
    uint8_t rx[3] = {0};

    /* outsig_sel → bits [5:4]; gpio_output_data → bits [3:0]; bit [6] untouched */
    global_data_reg_1 &= ~0x3F;                    /* clear bits [5:0] */
    global_data_reg_1 |= (mode & 0x3) << 4;        /* set outsig_sel */
    if (mode == 3) {
        global_data_reg_1 |= (value & 0xF);        /* set gpio_output_data */
    }

    tx[0] = global_data_reg_1 | 0x80;              /* write flag */
    tx[1] = global_data_reg_0;
    ret = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "set_portd_output: mode=%d val=%d data_reg_1=0x%02x", mode, value, global_data_reg_1);
    return ret;
}

/* ── Port D frequency toggle ──────────────────────────────────────────────
 * Drives Port D (P3) pins 0-3 as a square wave (0x00 ↔ 0x0F) using
 * esp_timer.  freq_hz=0 stops the timer and tristates Port D.
 * Valid non-zero values: 125, 250, 500, 1000 Hz.
 */
static esp_timer_handle_t s_portd_toggle_timer = NULL;
static volatile uint8_t   s_portd_toggle_state = 0;

static void portd_toggle_cb(void *arg)
{
    s_portd_toggle_state ^= 1;
    set_portd_output(PORTD_OUT_GPIO, s_portd_toggle_state ? 0x0F : 0x00);
}

esp_err_t set_portd_freq(uint32_t freq_hz)
{
    if (!g_board->has_fpga) {
        ESP_LOGI(TAG, "set_portd_freq skipped on board '%s'", g_board->name);
        return ESP_OK;
    }

    if (s_portd_toggle_timer) {
        esp_timer_stop(s_portd_toggle_timer);
        esp_timer_delete(s_portd_toggle_timer);
        s_portd_toggle_timer = NULL;
    }
    if (freq_hz == 0) {
        return set_portd_output(PORTD_OUT_TRISTATE, 0);
    }
    uint64_t half_us = 1000000ULL / (2ULL * freq_hz);
    esp_timer_create_args_t args = {
        .callback        = portd_toggle_cb,
        .arg             = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name            = "portd_tog",
    };
    esp_err_t ret = esp_timer_create(&args, &s_portd_toggle_timer);
    if (ret != ESP_OK) return ret;
    s_portd_toggle_state = 0;
    return esp_timer_start_periodic(s_portd_toggle_timer, half_us);
}

bool gbl_sw2_gpio48_flag = false;
void check_sw1_sw2(void)
{
    static uint8_t L0 = 0, L48 = 0;    /* Previous GPIO levels, persist across calls */

    // Read the level of GPIO0
    int level_0 = ael_board_has_valid_gpio(PIN_PUSHBUTTON_BOOT_SW1) ? gpio_get_level(PIN_PUSHBUTTON_BOOT_SW1) : 0;

    // Read the level of GPIO48
    int level_48 = ael_board_has_valid_gpio(PIN_PUSHBUTTON_SW2) ? gpio_get_level(PIN_PUSHBUTTON_SW2) : 0;

    if(L0 != level_0 || L48 != level_48){
        if(g_board->has_secondary_button && L48 != level_48 && level_48 == 1){
            gbl_sw2_gpio48_flag = !gbl_sw2_gpio48_flag;
        }
        ESP_LOGI(TAG, "GPIO%d Level: %d | GPIO%d Level: %d gbl_sw2_gpio48_flag=%s",
                PIN_PUSHBUTTON_BOOT_SW1, level_0,
                PIN_PUSHBUTTON_SW2, level_48,
                gbl_sw2_gpio48_flag ? "True":"False");
        L0 = level_0;
        L48 = level_48;
    }
}

/* Draw initial WiFi mode/SSID info on LCD before network is up. */
static void draw_wifi_startup_info(void)
{
    if (g_app_params.mode == APP_MODE_AP) {
        char ap_ip_buf[16] = {0};
        get_ap_ip_str(ap_ip_buf, sizeof(ap_ip_buf));
        Paint_DrawString_EN(X_OFFSET, 10, "AP Mode", &CURR_FONT, BLACK, BLUE);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 2, "SSID:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 2, g_app_params.wifi_ssid, &CURR_FONT, BLACK, MAGENTA);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 3, "PSWD:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 3, g_app_params.wifi_pass, &CURR_FONT, BLACK, MAGENTA);
    } else {
        Paint_DrawString_EN(X_OFFSET, 10, "ST Mode", &CURR_FONT, BLACK, BLUE);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 2, "SSID:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 2, g_app_params.wifi_ssid, &CURR_FONT, BLACK, MAGENTA);
    }
    // Port row: "PORT XVC:2542 GDB:4242"
    Paint_DrawString_EN(X_OFFSET, 10+24*4, "PORT ", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 5*PAINT_CHAR_WIDTH,  10+24*4, "XVC:", &CURR_FONT, BLACK, BLUE);
    Paint_DrawString_EN(X_OFFSET + 9*PAINT_CHAR_WIDTH,  10+24*4, "2542", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 13*PAINT_CHAR_WIDTH, 10+24*4, "GDB:", &CURR_FONT, BLACK, BLUE);
    Paint_DrawString_EN(X_OFFSET + 17*PAINT_CHAR_WIDTH, 10+24*4, "4242", &CURR_FONT, BLACK, MAGENTA);
}

/* Draw PA/PB/PC/PD port configuration on LCD. */
static void draw_port_cfg_info(void)
{
    uint32_t y = 10 + 24*5;
    Paint_DrawString_EN(X_OFFSET, y, "PA:          PB:", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 3*PAINT_CHAR_WIDTH, y, "LA", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 16*PAINT_CHAR_WIDTH, y,
        (gbl_pb_cfg == PB_UART_SRESET_VTARGET) ? "UART" : "LA", &CURR_FONT, BLACK, MAGENTA);

    y += 15;
    Paint_DrawString_EN(X_OFFSET, y, "PC:          PD:", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 3*PAINT_CHAR_WIDTH, y,
        (gbl_pc_cfg == PC_BMP_SWD_JTAG) ? "SWD/JTAG" : "LA", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 16*PAINT_CHAR_WIDTH, y,
        (gbl_pd_cfg == PD_FPGA_XVC) ? "XVC" : "LA", &CURR_FONT, BLACK, MAGENTA);
}

/* Start background tasks (GDB, logic analyser, XVC). */
static void start_background_tasks(void)
{
    if (gbl_pc_cfg == PC_BMP_SWD_JTAG) {
        ESP_LOGI(TAG, "Creating gdb_thread task. gbl_pa_cfg=%d, gbl_pc_cfg=%d", gbl_pa_cfg, gbl_pc_cfg);
        ESP_LOGI(TAG, "Free heap: %u", esp_get_free_heap_size());
        ESP_LOGI(TAG, "To do platform_init() for BMP");
        platform_init();
        ESP_LOGI(TAG, "To do xTaskCreate(&gdb_application_thread) for BMP");
        BaseType_t result = xTaskCreate(&gdb_application_thread, "gdb_thread", 4096, NULL, 15, NULL);
        if (result != pdPASS) {
            ESP_LOGE(TAG, "Failed to create gdb_thread task! Out of memory?");
        }
    }

