1atabey1/esp32tricore-dap/main/main.c
    if (g_board->has_logic_analyzer) {
        logic_analyzer_init();
    }

    if (g_board->has_xvc && gbl_pd_cfg == PD_FPGA_XVC) {
        ESP_LOGI(TAG, "To do xTaskCreate(xvc_server_task)");
        xTaskCreate(xvc_server_task, "xvc_server_task", 4096, NULL, 5, NULL);
    }
}

void app_main(void) {

    global_data_reg_0 = 0;
    global_data_reg_1 = 0; // set PC and PD as input
    g_board = ael_board_profile_get();

    esp_log_level_set(TAG, ESP_LOG_INFO);
    ESP_LOGI(TAG, "Board profile: %s", g_board->name);
    init_idf_components();

    gbl_spi_rxbuf = heap_caps_malloc(2048, MALLOC_CAP_DMA);
    assert(gbl_spi_rxbuf);

    capture_start_semaphore = xSemaphoreCreateBinary();
    capture_done_semaphore = xSemaphoreCreateBinary();

#if ESP32JTAG_BOARD
    // esp32jtag v1.3/v1.4 pwm to Vout mapping (approx):
    // 0-->3.36V, 6-->3.32V, 8-->3.30V, 12-->3.27V, 18-->3.23V, 22-->3.20V, 32-->3.13V, 40-->3.03V,
    // 100-->2.65V, 120-->2.52V, 123-->2.50V, 200-->1.99V, 220-->1.85V, 228-->1.80V, 235-->1.75V,
    // 250-->1.66V, 271-->1.50V, 275-->1.48V, 300-->1.33V, 318-->1.20V, 320-->1.19V,
    // 322-->1.18V, 350-->1.00V, 400-->0.66V
    uint16_t pwm1_duty = INITIAL_VIO_DUTY;  /* default: 3.3V when key absent */
    {
        char *volt_str = NULL;
        if (storage_alloc_and_read(TARGET_VOLTAGE_KEY, &volt_str) == ESP_OK && volt_str) {
            int idx = atoi(volt_str);
            free(volt_str);
            if (idx >= 0 && idx < (int)VIO_DUTY_TABLE_SIZE) {
                pwm1_duty = vio_duty_table[idx];
            }
        }
        /* If key absent (fresh flash or after factory reset): pwm1_duty stays INITIAL_VIO_DUTY = 3.3V */
    }
    ESP_LOGI(TAG, "VIO voltage: pwm1_duty=%u", pwm1_duty);
    setup_pwm1();
    set_pwm1_duty(pwm1_duty);
#endif
    AD_CH1_init();

    load_network_params();
    load_port_configurations();

    //LCD related starts here ****
    if (g_board->has_lcd) {
        lcd_init();
        lcd_clear(); //clear screen
        Paint_NewImage(LCD_WIDTH, LCD_HEIGHT, 0, BLACK);
    }

    if (g_board->has_fpga) {
        ICE_Init();
        load_fpga();
    }

    if (g_board->has_lcd) {
        draw_wifi_startup_info();
    }

    if (g_app_params.mode == APP_MODE_AP) {
    } else {
        ESP_LOGI(TAG, "Waiting for the network connection...");
    }

    httpd_handle_t http_handle;
    if (web_server_start(&http_handle) != ESP_OK) {
        ESP_LOGE(TAG, "Web server couldn't be started!");
        goto _wait;
    }

    struct network_init_config config = {
        .adapter_name = g_app_params.net_adapter_name,
        .ssid = g_app_params.wifi_ssid,
        .pass = g_app_params.wifi_pass,
        .http_handle = &http_handle
    };

    if (network_start(&config) != ESP_OK) {
         // Fallback logic
        ESP_LOGI(TAG, "Network connection can not be establised. Please check your wifi credentials!");

        // Fallback to AP mode
        if (g_app_params.mode == APP_MODE_STA) {
            ESP_LOGW(TAG, "STA connection failed. Switching to AP Mode fallback.");

            // Save AP mode settings to NVS
            storage_handle_t h;
            if (storage_open_session(&h) == ESP_OK) {
                storage_write_session(h, WIFI_MODE_KEY, "AP", 2);
                storage_close_session(h);
            }
        } else {
            ESP_LOGW(TAG, "Network connection failed!");
        }
        ESP_LOGW(TAG, "Restarting in 3 seconds...");
        vTaskDelay(3000 / portTICK_PERIOD_MS);
        esp_restart();
    }

    //Go on for successful connection
    if (!strcmp(config.adapter_name, "wifiprov")) {
        network_get_sta_credentials(g_app_params.wifi_ssid, g_app_params.wifi_pass);
        storage_write(WIFI_SSID_KEY, g_app_params.wifi_ssid, strlen(g_app_params.wifi_ssid));
        storage_write(WIFI_PASS_KEY, g_app_params.wifi_pass, strlen(g_app_params.wifi_pass));

        ESP_LOGI(TAG, "Wifi credentials have been changed. Restarting in 2 seconds...");
        vTaskDelay(2000 / portTICK_PERIOD_MS);
        esp_restart();
    }

    network_get_my_ip(g_app_params.my_ip);

    // **** IP address display for STA mode goes here ****
    if (g_board->has_lcd) {
        if (g_app_params.mode == APP_MODE_STA) {
            Paint_DrawString_EN(X_OFFSET, 10 + 24, "IP:", &CURR_FONT, BLACK, YELLOW);
            Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24, g_app_params.my_ip, &CURR_FONT, BLACK, MAGENTA);
        } else if (g_app_params.mode == APP_MODE_AP) {
            char ap_ip_buf[16] = {0};
            get_ap_ip_str(ap_ip_buf, sizeof(ap_ip_buf));
            Paint_DrawString_EN(X_OFFSET, 10 + 24, "IP:", &CURR_FONT, BLACK, YELLOW);
            Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24, ap_ip_buf, &CURR_FONT, BLACK, MAGENTA);
        }
    }

    esp_err_t ret_spi = ESP_OK;
    if(gbl_spi_h1 == NULL){
        ret_spi = spi_master_init();
        if (ret_spi != ESP_OK) {
            ESP_LOGE(TAG, "SPI init failed: %s", esp_err_to_name(ret_spi));
        }
    }

    // SPI mode for SWD/JTAG is currently disabled — always use GPIO bitbang.
    // SPI mode has known issues and is not ready for use.
    // In the future, this can be re-enabled: the mode will be configurable via
    // the web interface and persisted in NVS under MCU_INTERFACE_KEY ("SPI"/"GPIO").
    // When that time comes, restore the NVS read block below and remove this forced assignment.
    SPI_nGPIO = false;

    //set PA and PC for swd_jtag. They are mutual excluded: Either use PA or PC for swd_jtag.
    bool b_use_porta = false; //gbl_pa_cfg == PA_BMP_SWD_JTAG;
    bool b_use_portb = gbl_pb_cfg != PB_LOGICANALYZER;
    bool b_use_portc = (gbl_pc_cfg == PC_BMP_SWD_JTAG);
    bool b_use_portd = gbl_pd_cfg != PD_LOGICANALYZER;
    ESP_LOGI(TAG, "To set_cfga(), Using %s for SWD/JTAG, b_use_porta=%d, b_use_portc=%d", SPI_nGPIO ? "SPI" : "GPIO", b_use_porta, b_use_portc);
    /* Establish the safe inactive level while Port B is still disconnected,
     * then enable its output. set_cfga() preserves the SRESET bit. */
    set_sreset(false);
    //esp32jtag_common.h:esp_err_t set_cfga(bool use_portc, bool use_porta, bool njtag_swdio, bool swd_gpio);
    set_cfga(b_use_porta, b_use_portb, b_use_portc, b_use_portd, true, !SPI_nGPIO); // use_portc, not use_porta, swdio, SPI not gpio

    set_la_input_sel(false);

