1atabey1/esp32tricore-dap/main/main.c
#if CONFIG_AEL_DAP_BRINGUP_AT_BOOT
    b_use_portb_cached = b_use_portb;
    b_use_portd_cached = b_use_portd;
    dap_la_capture_test();

    /*
     * Sweep the ADC channels the schematic wires to the port pins through 100 K
     * dividers (R108: PA01, PB01; R109: PC01, PD01).  With a target attached
     * this is a four-point voltmeter on the connector, which is the cheapest
     * way to tell an unpowered target from a protocol problem.  Raw counts are
     * logged rather than scaled volts: the divider ratio is only known for the
     * one channel the firmware already scales.
     */
    for (int ch = ADC_CHANNEL_0; ch <= ADC_CHANNEL_4; ch++) {
        adc_oneshot_chan_cfg_t cfg = {
            .atten = ADC_ATTEN_DB_12,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        if (adc_oneshot_config_channel(gbl_adc_handle, ch, &cfg) != ESP_OK) {
            continue;
        }
        int raw = 0;
        if (adc_oneshot_read(gbl_adc_handle, ch, &raw) == ESP_OK) {
            ESP_LOGI(TAG, "port ADC ch%d raw=%d", ch, raw);
        }
    }

    /* Port C is now routed to the S3's GPIO, which is what the DAP probe needs.
     * Run before start_background_tasks() so BMP's gdb thread is not also
     * holding these pins. */
    if (b_use_portc) {
        if (dap_probe_init(CONFIG_AEL_DAP_BRINGUP_CLOCK_HZ) == ESP_OK) {
            dap_probe_bringup_report();
        }
    } else {
        ESP_LOGW(TAG, "DAP bring-up skipped: Port C is not in SWD/JTAG mode");
    }
#endif

    start_background_tasks();

#if AEL_BOARD_HAS_DAP_PROBE
    /*
     * After start_background_tasks(), because BMP's platform_init() runs in
     * there and leaves GPIO 40 - our TRST - low.  On a bench where that pin is
     * the target's reset, losing this call leaves the target powered but held
     * in reset, which is exactly what happened when the boot-time bring-up was
     * disabled: the bring-up had been releasing it as a side effect.
     */
    dap_probe_park_idle();

    /*
     * Register the TriCore with BMP's GDB server, so port 4242 has a target
     * to attach to without anyone first poking an HTTP endpoint.
     *
     * After start_background_tasks() for two reasons: platform_init() runs in
     * there and drives TRST, and target_new() appends to a list BMP owns.
     *
     * A failure here is logged and otherwise ignored.  It means no target was
     * found - no board attached, or powered down - and that is a normal state
     * for a probe sitting on a desk, not a reason to hold up the rest of the
     * boot.  /api/dap_gdb/attach retries it once there is something to find.
     */
    if (b_use_portc) {
        if (tricore_bmp_probe() != ESP_OK) {
            ESP_LOGW(TAG, "no TriCore registered with GDB yet - attach later "
                          "with /api/dap_gdb/attach");
        }
    }
#endif

    if (g_board->has_lcd) {
        draw_port_cfg_info();
    }
    init_gpio_sw1_sw2();

_wait:

    char *disable_dap_val = NULL;
    bool disable_usb_dap = true;  /* default: disabled */
    if (storage_alloc_and_read(DISABLE_USB_DAP_KEY, &disable_dap_val) == ESP_OK && disable_dap_val) {
        disable_usb_dap = (strcmp(disable_dap_val, "1") == 0);
        free(disable_dap_val);
    }

    if (!disable_usb_dap) {
        xTaskCreate(cherry_dap_task, "cherry_dap_task", 4096, NULL, 5, NULL);
    } else {
        ESP_LOGI(TAG, "USB based CMSIS-DAP and COM port is disabled");
    }

    ESP_LOGI(TAG, "[APP] Free memory: %lu bytes", esp_get_free_heap_size());
    while (true) {
        ESP_LOGI(TAG, "Free internal and DMA memory: %d %d",
                heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                heap_caps_get_free_size(MALLOC_CAP_DMA));

        if (g_app_params.mode == APP_MODE_AP && g_board->has_lcd) {
            print_sta_info();
        }

        vTaskDelay(3000 / portTICK_PERIOD_MS);
    }

    esp_restart();
}
